var questions = [
    {
        "question":"NBA有幾支球隊?",
        "answers":[
            ["30",2],
            ["28",3],
            ["32",4]
        ]
    },
    {
        "question":"NBA是何時成立的？",
        "answers":[
            ["1946年6月6日",3],
            ["2000年6月7日",4],
            ["2015年6月5日",5]
        ]
    },
    {
        "question":"何時舉辦NBA選秀會？",
        "answers":[
            ["每年的6月底",4],
            ["每年的7月底",5],
            ["每年的8月底",6]
        ]
    },
    {
        "question":"NBA例行賽共有幾場比賽呢?",
        "answers":[
            ["55場",5],
            ["82場",6],
            ["30場",7]
        ]
    },
    {
        "question":"NBA的比賽一節有幾分鐘？",
        "answers":[
            ["8分鐘",6],
            ["10分鐘",7],
            ["12分鐘",8]
        ]
    },
    {
        "question":"哪支球隊是2016-17賽季總冠軍?",
        "answers":[
            ["湖人",7],
            ["勇士",8],
            ["騎士","A"]
        ]
    },
    {
        "question":"哪一支球隊拿過最多次總冠軍？",
        "answers":[
            ["賽爾提克",8],
            ["勇士",9],
            ["湖人",10]
        ]
    },
    {
        "question":"誰是NBA的生涯得分王？",
        "answers":[
            ["Kobe Bryant",9],
            ["Kareem Abdul-Jabbar",10],
            ["Karl Malone",11]
        ]
    },
    {
        "question":"哪位球員拿過最多次總冠軍？",
        "answers":[
            ["Bill Russell",12],
            ["Kobe Bryant",13],
            ["Karl Malone",14]
        ]
    },
    {
        "question":"一支NBA球隊能有幾位球員？",
        "answers":[
            ["10",15],
            ["16",16],
            ["15",17]
        ]
    }
    
];
var score1=answers[2]+answers[3]+answers[4]+answers[6]+answers[8]+answers[8]+answers[10]+answers[12]+answers[15];
var allscore={"讚":score1}; 
/*var finalAnswers={
        "A":["愛情有點酸","在2018年，你的愛情有一些酸哦，不過還好，不苦，而且有時候雖然酸，酸中也帶了絲甜。即使你會與喜歡的人沒有緣分走到一起，但是你們彼此能祝福對方。心中有些酸，是因為你看得開。現在對愛情真的看得淡了，不會強求，也不渴望什麼轟轟烈烈，甜甜蜜蜜，只希望過了這陣酸，會有甜頭來。"],
        "B":["愛情超級甜","在2018年裡，你的愛情超級甜蜜哦，真的有如蜜糖一樣甜，不時撒一把狗糧，能讓旁邊的人都覺得發膩哦。當然啦，你這麼幸運，遇到甜蜜的愛情，也是因為你是一個溫暖的人啊，值得這麼好的愛情，也值得別人好好疼愛你。你也會加倍珍惜，好好回饋對方，這樣才是愛情的正確打開方式。"],
        "C":["愛情有苦有甜","你在2018年的愛情，一定是有苦也有甜的，其實這才是正常的感情，或者說普通的感情。有的人一直甜蜜，他們是幸運兒。而你是普通人，感情中會有甜蜜的時候，也會有爭吵矛盾，會有淚水，會有痛苦。但是學會理智經營感情，在甜的時候好好享受，在苦的時候及時審視，愛情才能持久。"],
        "D":["愛情平淡沒滋味","2018年裡，你的愛情沒有啥滋味，可能你根本就遇不到愛情，繼續又單身一整年，這樣也好，你可以忙於賺錢。也可能你的愛情就是有如一碗平平淡淡的白開水，沒有什麼滋味，但是沒有它又不行。或者是缺少了一些刺激，但是誰的愛情能一直轟轟烈烈呢？平淡如水，細水長流，未嘗不是一件好事。"]
};*/